Revit 2027 API
AnalysisResultSchema.AnalysisDisplayStyleId Property
 ElementId of analysis display style overriding the style set for view; -1 if the style is not overridden
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AnalysisDisplayStyleId { get; set; }
Public Property AnalysisDisplayStyleId As ElementId
	Get
	Set
public:
property ElementId^ AnalysisDisplayStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member AnalysisDisplayStyleId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace